# Series

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c'] #Creating python objects
my_data = [10,20,30]
array = np.array(my_data)
d = {'a':10,'b':20}

In [4]:
pd.Series(data = array,index = labels)  #first parameter is the data, next is indices.

a    10
b    20
c    30
dtype: int32

In [5]:
pd.Series(d) #Just passing the dictionaries works with key as the index and the value as the data list.

a    10
b    20
dtype: int64

# Dataframes

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101) #to get the same random number.

In [8]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #Dataframes are basically collections of series 
                                                                      #that share the same index

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
#Slicing in dataframes. 
df['W'] #Pass in the column name

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
df[['W','Z']] #For multiple columns pass in a LIST of columns you want.

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
df['New'] = df['W'] + df['Y'] #You can pull of new columns from the linear combination of existing columns.
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [13]:
df.drop('New',axis=1) #To remove columns you need to pass (Column,axis=1 (for columns, 0 for rows which is default))

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df #You still have the new column, so what you gotta do is use the inplace method

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
df.drop('New',axis=1,inplace = True)

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
#To slice for rows
df.loc['A'] #Pass the row name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [18]:
df.iloc[2] #This passes the index of the row you want, here it is row index 2, meaning row C

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [19]:
#To slice subsets
df.loc['A','X'] #Pass the row,column to get a value
df.loc[['A','B','C'],['W','X']] #Pass in the list of rows and columns to get a subset

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122

In [20]:
booldf = df > 0 #Conditional selection
df[booldf] #You get the values where it is true and nulls where false.
#df[df>0] is a simpler code

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df[df['W']>0] #Will output a new dataframe with those rows in which values of data in column W is positive.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[df['W']>0][['X','Z']] #Will get the columns which you want. REMEMBER TO PASS A LIST OF COLUMNS

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [23]:
df[(df['W']>0) & (df['Y']>0)] #Use paranthesis for conditions and dont use 'and', you have to use '&'. Use '|' instead of or

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.reset_index() #Converts indices into a new column. Pass "inplace=true" to make it permanent.

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [25]:
newind = 'IND CHI USA FRA ENG'.split() #Innovative way to create a list.

In [26]:
newind

['IND', 'CHI', 'USA', 'FRA', 'ENG']

In [27]:
df['Countries'] = newind #Adding a column to the dataframe.
df

          W         X         Y         Z Countries
A  2.706850  0.628133  0.907969  0.503826       IND
B  0.651118 -0.319318 -0.848077  0.605965       CHI
C -2.018168  0.740122  0.528813 -0.589001       USA
D  0.188695 -0.758872 -0.933237  0.955057       FRA
E  0.190794  1.978757  2.605967  0.683509       ENG

In [28]:
df.set_index("Countries") #This will overwrite the old index

                  W         X         Y         Z
Countries
IND        2.706850  0.628133  0.907969  0.503826
CHI        0.651118 -0.319318 -0.848077  0.605965
USA       -2.018168  0.740122  0.528813 -0.589001
FRA        0.188695 -0.758872 -0.933237  0.955057
ENG        0.190794  1.978757  2.605967  0.683509

# Multi Index and Index Hierarchy

In [29]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [30]:
df2 = pd.DataFrame(randn(6,2),hier_index,['A','B'] )
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [31]:
df2.loc['G1'].loc[1]['A'] #SLicing to get an element.

0.3026654485851825

In [32]:
df2.index.names = ['Groups','Num'] #naming the columns of indexes
df2

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [33]:
df2.xs(1,level='Num')     #Selecting a crosssection.

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [34]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} #Remember, no paranthesis after the np.nan method

In [35]:
df3 = pd.DataFrame(d)
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
print(df3.dropna()) #drops rows with null values. if you mention axis=1, it will drop columns with null values.
print(df3.dropna(axis=1))

     A    B  C
0  1.0  5.0  1
   C
0  1
1  2
2  3

In [37]:
df3.dropna(thresh=2) #the rows which have non zero values greater than equal to thresh will be shown

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [38]:
df3.fillna(value=3) #Fills all null values with the value insterted (not permanent again)

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3

In [39]:
df3['A'].fillna(value=df3['A'].mean())  #Fills the null values in column A with the average of the non zero values.

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [40]:
#Groupby is used to group rows by column names.
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [41]:
df4 = pd.DataFrame(data)
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [42]:
df4.groupby('Company').mean()
 #You can use various aggregate functions such as mean,sum,max,min,count etc. The output
              #is a dataframe which can be analysed further.

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [43]:
df4.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Operations

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()  #To get an array of unique elements.

array([444, 555, 666], dtype=int64)

In [6]:
len(df['col2'].unique()) #To find the number of unique elemnts, or simply length of array of unique elements.

3

In [7]:
df['col2'].value_counts() #Shows how many times each element appears.

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
def times2(x):
    return x*2

In [9]:
df['col1'].apply(times2)  #applying your own functions.

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df['col2'].apply(lambda x:x*2)  #Use lambda functions when you want to use a function only once.

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [12]:
df.sort_values('col2') #Insert the column you want to sort by. Index stays

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [13]:
df.isnull() #Returns a boolean dataframe if the values are null or not.

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [18]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [17]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [22]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
df.to_csv('My_op',index=False) #Save As option

In [30]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [33]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='New') #Saving as a new Excel

In [34]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [36]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"